krishnakumar4a4/esp8266-twitter/TwitterWebAPI.h
      auto is_key_contains = [](std::vector<std::string> const &argv, std::string const &key)
      {
        size_t keylen = key.size();
        for (std::string const &s : argv)
        {
          if (strncmp(s.c_str(), key.c_str(), keylen) == 0 && s[keylen] == '=')
          {
            return true;
          }
        }
        return false;
      };

      std::string oauth_nonce = "oauth_nonce";
      if (!is_key_contains(*args, oauth_nonce))
      {
        oauth_nonce += '=';
        oauth_nonce += nonce(timevalue);
        args->push_back(oauth_nonce);
      }

      std::string oauth_timestamp = "oauth_timestamp";
      if (!is_key_contains(*args, oauth_timestamp))
      {
        oauth_timestamp += '=';
        oauth_timestamp += to_s((int)timevalue);
        args->push_back(oauth_timestamp);
      }

      if (!keys.accesstoken.empty())
      {
        std::string oauth_token = "oauth_token";
        oauth_token += '=';
        oauth_token += keys.accesstoken;
        args->push_back(oauth_token);
      }

      std::string oauth_consumer_key = "oauth_consumer_key";
      oauth_consumer_key += '=';
      oauth_consumer_key += keys.consumer_key;
      args->push_back(oauth_consumer_key);

      std::string oauth_signature_method = "oauth_signature_method";
      oauth_signature_method += '=';
      oauth_signature_method += "HMAC-SHA1";
      args->push_back(oauth_signature_method);

      std::string oauth_version = "oauth_version";
      if (!is_key_contains(*args, oauth_version))
      {
        oauth_version += '=';
        oauth_version += "1.0";
        args->push_back(oauth_version);
      }
    }
    std::sort(args->begin() + 1, args->end());

    auto Combine = [](std::initializer_list<std::string> list)
    {
      std::string text;
      for (std::string const &s : list)
      {
        if (!s.empty())
        {
          if (!text.empty())
          {
            text += '&';
          }
          text += misc::url_encode(s);
        }
      }
      return text;
    };

    std::string query = oauth::build_url(*args, 1);

    std::string httpmethod;
    if (http_method == http_method_t::GET)
    {
      httpmethod = "GET";
    }
    else if (http_method == http_method_t::POST)
    {
      httpmethod = "POST";
    }
    std::string m = Combine({httpmethod, (*args)[0], query});
    std::string k = Combine({std::string(keys.consumer_sec), std::string(keys.accesstoken_sec)});

    std::string oauth_signature = "oauth_signature";
    oauth_signature += '=';
    oauth_signature += sign_hmac_sha1(m, k);

    args->push_back(oauth_signature);
  }
  static void split_url(const char *url, std::vector<std::string> *out)
  {
    out->clear();
    char const *left = url;
    char const *ptr = left;
    while (1)
    {
      int c = *ptr & 0xff;
      if (c == '&' || c == '?' || c == 0)
      {
        if (left < ptr)
        {
          out->push_back(std::string(left, ptr));
        }
        if (c == 0)
          break;
        ptr++;
        left = ptr;
      }
      else
      {
        ptr++;
      }
    }
    for (size_t i = 1; i < out->size(); i++)
    {
      std::string *p = &out->at(i);
      *p = misc::url_decode(*p);
    }
  }
  static std::string split_url_right(const char *url)
  {
    std::string u = std::string(url);
    std::size_t pos = u.find("?");
    if (pos == std::string::npos) {
      return "";
    }
    std::string rightstr = u.substr(pos, u.length());
    return rightstr;
  }
  static std::string build_url(const std::vector<std::string> &argv, int start)
  {
    const char sep = '&';
    std::string query;
    for (size_t i = start; i < argv.size(); i++)
    {
      std::string s = argv[i];
      if (i > 0)
      {
        char const *p = s.c_str();
        char const *e = strchr(p, '=');
        if (e)
        {
          std::string name(p, e);
          std::string value = e + 1;
          s = name + '=' + misc::url_encode(value);
        }
        else
        {
          s += '=';
        }
      }
      if (!query.empty())
      {
        query += sep;
      }
      query += s;
    }
    return query;
  }

  // For adding double quotes for Oauth values as per twitter def
  static std::string build_url_with_quotes(const std::vector<std::string> &argv, int start)
  {
    const char sep = ',';
    std::string query;
    for (size_t i = start; i < argv.size(); i++)
    {
      std::string s = argv[i];
      if (i > 0)
      {
        char const *p = s.c_str();
        char const *e = strchr(p, '=');
        if (e)
        {
          std::string name(p, e);
          std::string value = e + 1;
          s = name + '=' + '"' + misc::url_encode(value) + '"';
        }
        else
        {
          s += '=';
        }
      }
      if (!query.empty())
      {
        query += sep;
      }
      query += s;
    }
    return query;
  }

  static std::string build_oauth_auth(const std::vector<std::string> &argv, int start)
  {
    // const char sep = '&';
    const char sep = ',';
    bool flag = false;
    std::string query;
    for (size_t i = start; i < argv.size(); i++)
    {
      std::string s = argv[i];
      if (i > 0)
      {
        char const *p = s.c_str();
        char const *e = strchr(p, '=');
        if (e)
        {
          std::string name(p, e);
          std::string value = e + 1;
          // s = misc::url_encode(name) + '=' + misc::url_encode(value);
          if ((name.compare("oauth_signature") == 0) or (name.compare("oauth_consumer_key") == 0) or (name.compare("oauth_nonce") == 0) or (name.compare("oauth_signature_method") == 0) or (name.compare("oauth_timestamp") == 0) or (name.compare("oauth_token") == 0) or (name.compare("oauth_version") == 0))
          {
            s = " " + misc::url_encode(name) + '=' + '"' + misc::url_encode(value) + '"';
            flag = true;
          }
          else
          {
            flag = false;
          }
        }
        else
        {
          s += '=';
        }
      }
      if (!query.empty() and flag)
      {
        query += sep;
      }
      if (flag)
        query += s;
    }
    return query;
  }

  static void hmac_sha1(uint8_t const *key, size_t keylen, uint8_t const *in, size_t inlen, uint8_t *out)
  {
    sha1::Context sha1;
    uint8_t tmp[20];

    uint8_t ibuf[64];
    uint8_t obuf[64];
    memset(ibuf, 0, 64);
    memset(obuf, 0, 64);
    memcpy(ibuf, key, keylen);
    memcpy(obuf, key, keylen);

    for (int i = 0; i < 64; i++)
    {
      ibuf[i] ^= 0x36;
      obuf[i] ^= 0x5c;
    }

    sha1::Reset(&sha1);
    sha1::Input(&sha1, ibuf, 64);
    sha1::Input(&sha1, in, inlen);
    sha1::Result(&sha1, tmp);

    sha1::Reset(&sha1);
    sha1::Input(&sha1, obuf, 64);
    sha1::Input(&sha1, tmp, 20);
    sha1::Result(&sha1, out);
  }
  static std::string sign_hmac_sha1(std::string const &m, std::string const &k)
  {
    uint8_t key[20];
    uint8_t result[20];

    sha1::Context sha1;
    sha1::Reset(&sha1);
    sha1::Input(&sha1, (uint8_t const *)k.c_str(), k.size());
    sha1::Result(&sha1, key);

