krishnakumar4a4/esp8266-twitter/TwitterWebAPI.h
    hmac_sha1(key, 20, (uint8_t const *)m.c_str(), m.size(), result);
    std::vector<char> vec;
    base64::encode((char const *)result, 20, &vec);
    return misc::to_stdstr(vec);
  }
};

class URL
{
private:
  std::string scheme_;
  std::string host_;
  int port_ = 0;
  std::string path_;

public:
  URL(const std::string &url)
  {
    char const *str = url.c_str();
    char const *left;
    char const *right;
    left = str;
    right = strstr(left, "://");
    if (right)
    {
      scheme_.assign(str, right - str);
      left = right + 3;
    }
    right = strchr(left, '/');
    if (right)
    {
      char const *p = strchr(left, ':');
      if (p && left < p && p < right)
      {
        int n = 0;
        char const *q = p + 1;
        while (q < right)
        {
          if (isdigit(*q & 0xff))
          {
            n = n * 10 + (*q - '0');
          }
          else
          {
            n = -1;
            break;
          }
          q++;
        }
        host_.assign(left, p - left);
        if (n > 0 && n < 65536)
        {
          port_ = n;
        }
      }
      else
      {
        host_.assign(left, right - left);
      }
      path_ = right;
    }
    if (port_ == 0)
    {
      if (scheme_ == "http")
      {
        port_ = 80;
      }
      else if (scheme_ == "https")
      {
        port_ = 443;
      }
    }
  }
  std::string const &scheme() const { return scheme_; }
  std::string const &host() const { return host_; }
  int port() const { return port_; }
  std::string const &path() const { return path_; }
  bool isssl() const
  {
    if (scheme() == "https")
      return true;
    if (scheme() == "http")
      return false;
    if (port() == 443)
      return true;
    return false;
  }
};

class TwitterClient
{
private:
  // WiFiClientSecure *client;
  NTPClient *timeClient;
  struct Data
  {
    oauth::Keys keys;
  } data;
  oauth::Keys const &keys() const
  {
    return data.keys;
  }
  struct RequestOption
  {
    enum Method
    {
      GET,
      POST,
    };
    Method method = GET;
    char const *post_begin = nullptr;
    char const *post_end = nullptr;
    char const *get_begin = nullptr;
    char const *get_end = nullptr;
    std::string upload_path;
    std::string right_str;
    unsigned int len = 0;
    void set_post_data(char const *begin, char const *end)
    {
      post_begin = begin;
      post_end = end;
      method = POST;
    }
    void set_get_data(char const *begin, char const *end, char const *right)
    {
      get_begin = begin;
      get_end = end;
      len = get_end - get_begin;
      // Serial.print("LenFn: ");
      // Serial.println(len);
      method = GET;
      right_str = std::string(right);
    }
    void set_upload_path(std::string const &path)
    {
      upload_path = path;
    }
  };

  bool requestV2(String message, const std::string &url, RequestOption const &opt, String *reply)
  {
    Serial.print("Tweet to be published: ");
    Serial.println(message);
    if (reply)
      *reply = "";
    if (opt.method == RequestOption::GET)
    {
      if (opt.upload_path.empty())
      {
        String host, path;
        int port = 0;
        {
          URL l(url);
          host = l.host().c_str();
          path = l.path().c_str();
          port = l.port();
        }
        WiFiClientSecure client;
        client.setInsecure();
        if (client.connected())
        {
          client.flush();
          client.stop();
        }
        client.setTimeout(TWI_TIMEOUT * 10);
        if (client.connect(host.c_str(), port))
        {
          client.println("GET " + path + opt.right_str.c_str() + " HTTP/1.1");
          client.println("Host: " + host);
          client.print("Authorization: OAuth ");
          client.write((uint8_t const *)opt.get_begin, opt.len);
          client.println();
          client.println("User-Agent: ESP8266");
          client.println("Accept: */*");
          client.println("Connection: keep-alive");
          client.println("Content-Type: application/json");
          // client.println("Accept-Encoding: gzip, deflate, br");
          client.println("Content-Length: 0");
          client.println();
          while (client.connected())
          {
            Serial.println("inside client.connected()");
            String header = client.readStringUntil('\n');
            Serial.print("header: ");
            Serial.println(header);
            if (header == "\r") {
              Serial.print("received: \r breaking");
              break; // headers received
            }
          }
          *reply = client.readString();
          if (client.available())
          {
            client.flush();
            client.stop();
          }
          return true;
        }
      }
    }
    else if (opt.method == RequestOption::POST)
    {
      if (reply)
        *reply = "";
      ;
      if (opt.upload_path.empty())
      {
        String host, path;
        int port = 0;
        {
          URL l(url);
          host = l.host().c_str();
          path = l.path().c_str();
          port = l.port();
        }
        WiFiClientSecure client;
        client.setInsecure();
        if (client.connected())
        {
          client.flush();
          client.stop();
        }
        client.setTimeout(TWI_TIMEOUT);
        if (client.connect(host.c_str(), port))
        {
          int len = opt.post_end - opt.post_begin;
          client.println("POST " + path + " HTTP/1.1");
          client.println("Host: " + host);
          client.print("Authorization: OAuth ");
          client.write((uint8_t const *)opt.post_begin, len);
          client.println();
          client.println("User-Agent: ESP8266");
          client.println("Connection: keep-alive");
          client.println("Content-Type: application/json");
          client.println("Accept: */*");
          // client.println("Accept-Encoding: gzip, deflate, br");
          client.print("Content-Length: ");
          String body = "{\"text\": \"";
          body.concat(message);
          body.concat("\"}");
          client.println(body.length());
          client.println();
          client.println(body);
          String s = client.readString();
          *reply = s;
          if (client.available())
          {
            client.flush();
            client.stop();
          }
          return true;
        }
      }
      else
      {
        // not implemented
      }
    }
    return false;
  }

  bool request(const std::string &url, RequestOption const &opt, String *reply)
  {
    if (reply)
      *reply = "";
    if (opt.method == RequestOption::GET)
    {
      if (opt.upload_path.empty())
      {
        String host, path;
        int port = 0;
        {
          URL l(url);
          host = l.host().c_str();
          path = l.path().c_str();
          port = l.port();
        }
        WiFiClientSecure client;
        client.setInsecure();
        if (client.connected())
        {
          client.flush();
          client.stop();
        }
        client.setTimeout(TWI_TIMEOUT);
        if (client.connect(host.c_str(), port))
        {
          Serial.print("path: ");
          Serial.println(path);
          Serial.print("right part: ");
          Serial.println(opt.right_str.c_str());
          client.print("GET " + path + opt.right_str.c_str() + " HTTP/1.1");
          // client.print("GET " + path);
          // client.print(opt.right_str.c_str());
          // client.println(" HTTP/1.1");
          client.println("Host: " + host);
          client.print("Authorization: OAuth");
          client.write((uint8_t const *)opt.get_begin, opt.len);
          client.println();
          client.println("User-Agent: ESP8266");
          client.println("Accept: */*");
          client.println("Connection: keep-alive");
          client.println("Content-Type: application/json");
          client.println("Accept-Encoding: gzip, deflate, br");
          client.println();
          while (client.connected())
          {
            Serial.println("inside client.connected()");
            String header = client.readStringUntil('\n');
            Serial.print("header: ");
            Serial.println(header);
            if (header == "\r") {
              Serial.print("received: \r breaking");
              break; // headers received
            }
          }
          // *reply = client.readString();
          String body = client.readString();
          Serial.print("body: ");
          Serial.println(body);
          *reply = body;
          if (client.available())
          {
            client.flush();
            client.stop();
          }
          return true;
        }
      }
    }
    else if (opt.method == RequestOption::POST)
    {
      if (reply)
        *reply = "";
      ;
      if (opt.upload_path.empty())
      {
        String host, path;
        int port = 0;
        {
          URL l(url);
          host = l.host().c_str();
          path = l.path().c_str();
          port = l.port();
        }
        WiFiClientSecure client;
        client.setInsecure();
        if (client.connected())
        {
          client.flush();
          client.stop();
        }
        client.setTimeout(TWI_TIMEOUT);
        if (client.connect(host.c_str(), port))
        {
          int len = opt.post_end - opt.post_begin;
          client.println("POST " + path + " HTTP/1.1");
          client.println("Host: " + host);
          client.print("Authorization: OAuth ");
          client.write((uint8_t const *)opt.post_begin, len);
          client.println();
          client.println("User-Agent: ESP8266");
          client.println("Connection: keep-alive");
          client.println("Content-Type: application/json");
          client.println("Accept: */*");
          client.println("Accept-Encoding: gzip, deflate, br");
          String body = "{\"text\": \"Hello World! 4\"}";
          client.print("Content-Length: ");
          client.println(body.length());
          client.println();
          client.println(body);
          // client.write((uint8_t const *)opt.post_begin, len);
          // client.write("test");
          String s = client.readString();
          *reply = s;
          // Serial.println("Tweeted");
          if (client.available())
          {
            client.flush();
            client.stop();
          }
          return true;
        }
      }
      else
      {
        // not implemented
      }
    }
    return false;
  }

