krishnakumar4a4/esp8266-twitter/TwitterWebAPI.h
public:
  TwitterClient()
  {
  }
  TwitterClient(NTPClient &timeClient, std::string const &consumer_key, std::string const &consumer_sec, std::string const &accesstoken, std::string const &accesstoken_sec)
  {
    // this->client = &client;
    this->timeClient = &timeClient;
    data.keys.consumer_key = consumer_key;
    data.keys.consumer_sec = consumer_sec;
    data.keys.accesstoken = accesstoken;
    data.keys.accesstoken_sec = accesstoken_sec;
  }

  void startNTP()
  {
    // client->setTimeout(TWI_TIMEOUT);
    timeClient->begin();
    timeClient->forceUpdate();
  }

  void startNTP(int timeOffset)
  {
    // client->setTimeout(TWI_TIMEOUT);
    timeClient->setTimeOffset(timeOffset);
    timeClient->begin();
    timeClient->forceUpdate();
  }

  void startNTP(int timeOffset, int updateInterval)
  {
    // client->setTimeout(TWI_TIMEOUT);
    timeClient->setTimeOffset(timeOffset);
    timeClient->setUpdateInterval(updateInterval);
    timeClient->begin();
    timeClient->forceUpdate();
  }

  String getTimeStamp()
  {
    timeClient->update();
    return timeClient->getFormattedTime();
  }

  unsigned long getEpoch()
  {
    timeClient->update();
    return timeClient->getEpochTime();
  }

  bool tweet(std::string message, const std::vector<std::string> *media_ids = nullptr)
  {
    timeClient->update();
    time_t currentTime = (time_t)timeClient->getEpochTime();

    if (message.empty())
    {
      return false;
    }

    std::string url = "https://api.twitter.com/2/tweets";
    oauth::Request oauth_req = oauth::sign(url.c_str(), oauth::POST, keys(), currentTime);
    String res;
    RequestOption opt;
    char const *p = oauth_req.post.c_str();
    opt.set_post_data(p, p + oauth_req.post.size());
    boolean status = requestV2(message.c_str(), oauth_req.url, opt, &res);
    Serial.println(res);
    return status;
  }

  String searchTwitter(std::string message)
  {
    timeClient->update();
    time_t currentTime = (time_t)timeClient->getEpochTime();
    // Serial.print("Epoch: "); Serial.println(currentTime);

    if (message.empty())
    {
      return "Error with user search term!";
    }

    std::string url = "https://api.twitter.com/2/tweets/search/recent";

    url += "?query=";
    url += misc::url_encode(message);

    oauth::Request oauth_req = oauth::sign(url.c_str(), oauth::GET, keys(), currentTime);
    String res;
    RequestOption opt;
    char const *p = oauth_req.getdata.c_str();
    char const *r = oauth_req.right.c_str();
    opt.set_get_data(p, p + oauth_req.getdata.size(), r);
    Serial.println("before request V2 call");
    bool status = requestV2("",oauth_req.url, opt, &res);
    if (status)
    {
      return res;
    }
    else
    {
      return "Error";
    }
  }

  String searchUser(std::string message)
  {
    timeClient->update();
    time_t currentTime = (time_t)timeClient->getEpochTime();
    //    Serial.print("Epoch: "); Serial.println(currentTime);

    if (message.empty())
    {
      return "Error with search term!";
    }

    std::string url = "https://api.twitter.com/2/users/by/username/";
    url += misc::url_encode(message);

    Serial.println("url formed");
    Serial.println(url.c_str());
    oauth::Request oauth_req = oauth::sign(url.c_str(), oauth::GET, keys(), currentTime);
    Serial.println("sign");
    String res;
    RequestOption opt;
    char const *p = oauth_req.getdata.c_str();
    char const *r = oauth_req.right.c_str();
    opt.set_get_data(p, p + oauth_req.getdata.size(), r);
    Serial.println("before request V2 call");
    bool status = requestV2("",oauth_req.url, opt, &res);
    if (status)
    {
      return res;
    }
    else
    {
      return "Error";
    }
  }
};